In [1]:
import numpy as np
from numpy.linalg import norm
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
data={"Users":['U1','U1','U2','U3','U2','U3','U3','U4','U5','U4','U5'],
     'Movie':['M1','M3','M1','M1','M3','M3','M2','M3','M1','M2','M3'],
     'Rating':[4,5,5,3,2,3,1,2,1,2,3]}

In [3]:
df=pd.DataFrame(data)
df

   Users Movie  Rating
0     U1    M1       4
1     U1    M3       5
2     U2    M1       5
3     U3    M1       3
4     U2    M3       2
5     U3    M3       3
6     U3    M2       1
7     U4    M3       2
8     U5    M1       1
9     U4    M2       2
10    U5    M3       3

In [4]:
df2=df.groupby(['Movie','Users']).sum().unstack().fillna(0)
df2

      Rating
Users     U1   U2   U3   U4   U5
Movie
M1       4.0  5.0  3.0  0.0  1.0
M2       0.0  0.0  1.0  2.0  0.0
M3       5.0  2.0  3.0  2.0  3.0

In [5]:
a = np.zeros((3, 3), float) 
np.fill_diagonal(a, 1) 
movie=pd.DataFrame(a,index=['M1','M2','M3'],columns=['M1','M2','M3'])
movie

     M1   M2   M3
M1  1.0  0.0  0.0
M2  0.0  1.0  0.0
M3  0.0  0.0  1.0

In [6]:
def calculate_similarity(movie1,movie2):
    a=df2['Rating'].loc[movie1].values
    b=df2['Rating'].loc[movie2].values
    similarity=np.dot(a,b)/(norm(a)*norm(b))
    similarity=float(round(similarity,4))
    movie[movie2][movie1]=similarity
    movie[movie1][movie2]=similarity
    print(movie)
    return similarity

In [7]:
calculate_similarity('M1','M2')

        M1      M2   M3
M1  1.0000  0.1879  0.0
M2  0.1879  1.0000  0.0
M3  0.0000  0.0000  1.0

0.1879

In [8]:
calculate_similarity('M1','M3')

        M1      M2      M3
M1  1.0000  0.1879  0.8235
M2  0.1879  1.0000  0.0000
M3  0.8235  0.0000  1.0000

0.8235

In [9]:
calculate_similarity('M2','M3')

        M1      M2      M3
M1  1.0000  0.1879  0.8235
M2  0.1879  1.0000  0.4384
M3  0.8235  0.4384  1.0000

0.4384

In [10]:
movie

        M1      M2      M3
M1  1.0000  0.1879  0.8235
M2  0.1879  1.0000  0.4384
M3  0.8235  0.4384  1.0000

In [11]:
df2['Rating']

Users   U1   U2   U3   U4   U5
Movie
M1     4.0  5.0  3.0  0.0  1.0
M2     0.0  0.0  1.0  2.0  0.0
M3     5.0  2.0  3.0  2.0  3.0

In [12]:
def calculate_rating(user,film):
    rating=df2['Rating'][user].values
    similarity=movie[film].values
    for i in range(len(rating)):
        if rating[i]==0:
            similarity[i]=0
    final_rating=np.dot(rating,similarity)/sum(similarity)
    df2['Rating'][user][film]=round(final_rating,2)
    return df2["Rating"]

In [13]:
calculate_rating('U4','M1')

Users   U1   U2   U3   U4   U5
Movie
M1     4.0  5.0  3.0  2.0  1.0
M2     0.0  0.0  1.0  2.0  0.0
M3     5.0  2.0  3.0  2.0  3.0

In [14]:
calculate_rating('U1','M2')

Users   U1   U2   U3   U4   U5
Movie
M1     4.0  5.0  3.0  2.0  1.0
M2     4.7  0.0  1.0  2.0  0.0
M3     5.0  2.0  3.0  2.0  3.0

In [15]:
calculate_rating('U2','M2')

Users   U1   U2   U3   U4   U5
Movie
M1     4.0  5.0  3.0  2.0  1.0
M2     4.7  2.9  1.0  2.0  0.0
M3     5.0  2.0  3.0  2.0  3.0

In [16]:
calculate_rating('U5','M2')

Users   U1   U2   U3   U4   U5
Movie
M1     4.0  5.0  3.0  2.0  1.0
M2     4.7  2.9  1.0  2.0  2.4
M3     5.0  2.0  3.0  2.0  3.0